Revit 2027 API
ExporterIFC.SetMaterialIdForCurrentExportState Method
 This sets the material id that is to be associated with the element in the current export state.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetMaterialIdForCurrentExportState(
	ElementId elementId
)
Public Sub SetMaterialIdForCurrentExportState (
	elementId As ElementId
)
public:
void SetMaterialIdForCurrentExportState(
	ElementId^ elementId
)
member SetMaterialIdForCurrentExportState :
        elementId : ElementId -> unit
Parameters
elementId ElementId
 The material id.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Even though there could be several materials associated with the element (set during PushExportState()), unless the element has support for IfcMaterialLayerSet, IFC output will include only this one.
See Also
Reference
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace